In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({"City":['Fsd','Fsd','Peshawar','Peshawar','Lahore','Lahore'],
                 'Temp':[99,100,90,98,34,99] })
df

       City  Temp
0       Fsd    99
1       Fsd   100
2  Peshawar    90
3  Peshawar    98
4    Lahore    34
5    Lahore    99

# GroupBy

In [5]:
# 1 split the data 
grp_a=df[df['City']=="Peshawar"]

In [7]:
grp_a

       City  Temp
2  Peshawar    90
3  Peshawar    98

In [8]:
grp_b=df[df['City']=="Fsd"]
grp_b

  City  Temp
0  Fsd    99
1  Fsd   100

In [9]:
grp_c=df[df['City']=="Lahore"]
grp_c

     City  Temp
4  Lahore    34
5  Lahore    99

In [10]:
avg_a=grp_a['Temp'].mean()

In [12]:
avg_a

94.0

In [18]:
avg_a=grp_a['Temp'].mean()
avg_a

94.0

In [19]:
avg_b=grp_b['Temp'].mean()
avg_b

99.5

In [15]:
avg_c=grp_c['Temp'].mean()

In [20]:
avg_c

66.5

In [21]:
grp_by=pd.DataFrame({"City":['Fsd','Peshawar','Lahore']
                     ,'Tepm':[avg_a,avg_b,avg_c]})

In [22]:
grp_by

       City  Tepm
0       Fsd  94.0
1  Peshawar  99.5
2    Lahore  66.5

In [23]:
df=pd.DataFrame({"City":['Fsd','Fsd','Peshawar','Peshawar','Lahore','Lahore'],
                 'Temp':[99,100,90,98,34,99] })

In [24]:
df

       City  Temp
0       Fsd    99
1       Fsd   100
2  Peshawar    90
3  Peshawar    98
4    Lahore    34
5    Lahore    99

In [25]:
grp=df.groupby('City').mean()

In [26]:
grp

          Temp
City
Fsd       99.5
Lahore    66.5
Peshawar  94.0

In [27]:
grp=df.groupby('City')
grp

In [28]:
for key,value in grp:
    print(key)
    print(value)

Fsd
  City  Temp
0  Fsd    99
1  Fsd   100
Lahore
     City  Temp
4  Lahore    34
5  Lahore    99
Peshawar
       City  Temp
2  Peshawar    90
3  Peshawar    98

In [29]:
grp.groups

{'Fsd': [0, 1], 'Lahore': [4, 5], 'Peshawar': [2, 3]}

In [30]:
grp=df.groupby('City')
grp.first()

          Temp
City
Fsd         99
Lahore      34
Peshawar    90

In [31]:
grp.size()

City
Fsd         2
Lahore      2
Peshawar    2
dtype: int64

In [34]:
grp=df.groupby("City")
grp

In [35]:
grp.get_group('Fsd')

  City  Temp
0  Fsd    99
1  Fsd   100

In [36]:
grp['Temp'].mean().add_prefix('Mean_Temprature_')

City
Mean_Temprature_Fsd         99.5
Mean_Temprature_Lahore      66.5
Mean_Temprature_Peshawar    94.0
Name: Temp, dtype: float64

In [37]:
grp.describe()

          Temp
         count  mean        std   min    25%   50%    75%    max
City
Fsd        2.0  99.5   0.707107  99.0  99.25  99.5  99.75  100.0
Lahore     2.0  66.5  45.961941  34.0  50.25  66.5  82.75   99.0
Peshawar   2.0  94.0   5.656854  90.0  92.00  94.0  96.00   98.0

In [38]:
grp.agg(['min','max','mean'])

         Temp
          min  max  mean
City
Fsd        99  100  99.5
Lahore     34   99  66.5
Peshawar   90   98  94.0

In [39]:
grp['Temp'].agg(['min','max','mean'])

          min  max  mean
City
Fsd        99  100  99.5
Lahore     34   99  66.5
Peshawar   90   98  94.0

In [40]:
def fun(grp):
    return {"Min":grp.min(),'Max':grp.max(),'Mean':grp.mean()}

In [42]:
fun(grp)

{'Min':           Temp
 City
 Fsd         99
 Lahore      34
 Peshawar    90,
 'Max':           Temp
 City
 Fsd        100
 Lahore      99
 Peshawar    98,
 'Mean':           Temp
 City
 Fsd       99.5
 Lahore    66.5
 Peshawar  94.0}

In [43]:
grp.apply(fun)

City
Fsd         {'Min': [99], 'Max': [100], 'Mean': [99.5]}
Lahore       {'Min': [34], 'Max': [99], 'Mean': [66.5]}
Peshawar     {'Min': [90], 'Max': [98], 'Mean': [94.0]}
dtype: object